/* Дан массив.
Написать функцию, которая вернет массив только из тех чисел, которые повторялись более одного раза в исходном
Напривер [1,1,1,4,4,5,1,6,6,74,74,74,3] вернет [1, 4, 6, 74]
*/

const oneTask = (arr) => {

};

/*Напишите функцию, которая поверхностно сравнивает два объекта.
Ожидаемый результат: true если объекты идентичны, false если объекты разные
Например: { a: 1, b: 1 }, { a: 1, b: 1 } => true; { a: 1, b: 1 }, { a: 2, b: 1 } => false
*/

const twoTask = (obj1, obj2) => {

};
module.exports = oneTask, twoTask;

