/* 1) Дан массив.
Написать функцию, которая вернет массив только из тех чисел, которые повторялись более одного раза в исходном
Напривер [1,1,1,4,4,5,1,6,6,74,74,74,3] вернет [1, 4, 6, 74]
*/

const oneTask = (arr) => {

};

/* 2) Напишите функцию, которая поверхностно сравнивает два объекта.
Ожидаемый результат: true если объекты идентичны, false если объекты разные
Например: { a: 1, b: 1 }, { a: 1, b: 1 } => true; { a: 1, b: 1 }, { a: 2, b: 1 } => false
*/

const twoTask = (obj1, obj2) => {

};

/* 3) Вернуть количество гласных, которые содержатся в строке
Например: 'Шла Саша по шоссе и сосала сушку' => 12
*/

const threeTask = (str) => {

};

/* 4) Дан случайный массив чисел. С помощью метода .filter()
отфильтруйте массив так, чтобы в новый массив вошли
только четные двухзначные числа из исходного.
*/

const fourTask = (arr) => {

};

/* 5) Напишите функцию, которая на вход принимает строку,
состоящую из букв нижнего регистра, а на выход возвращает boolean,
который отвечает, является ли данная строка палиндромом или нет.

Палиндром — слово или текст, одинаково читающееся в обоих направлениях.
*/

const fiveTask = (arr) => {

};

/* 6) Требуется написать функцию, выводящую числа в строкуЮ без пробелов от 1 до 20 включительно, с такими условиями:
вывод fizz вместо чисел, кратных 3;
вывод buzz вместо чисел, кратных 5;
вывод fizzbuzz вместо чисел, кратных как 3, так и 5.
*/

const sixTask = () => {
return 
};

module.exports = oneTask, twoTask, threeTask, fourTask, fiveTask, sixTask;

